# Parameter Type Id Rebar Termination Rotation At Start Schedules Tags Filters Property

Source: https://www.revitapidocs.com/2026/dad9f0dd-c516-8af4-dfed-c12276f97018.htm

---

| Parameter Type Id Rebar Termination Rotation At Start Schedules Tags Filters Property |
| --- |

"Rotation At Start"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarTerminationRotationAtStartSchedulesTagsFilters { get; }
```

```
Public Shared ReadOnly Property RebarTerminationRotationAtStartSchedulesTagsFilters As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarTerminationRotationAtStartSchedulesTagsFilters {
	ForgeTypeId^ get ();
}
```

```
static member RebarTerminationRotationAtStartSchedulesTagsFilters : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace